/*
	Демонстрация роли побочных эффектов
*/
class SideEffects{
	public static void main(String args[]){
		int i = 0;

		// Значение переменной i инкрементируется несмотря на то, что проверяемое условие в инструкции if ложно
		if(false & (++i < 100))
			System.out.println("Эта строка не будет отображаться");
		System.out.println("Инструкция if выполняется. Значение i: " + i); // отображается 1.

		// в данном случае значение переменной i не инкрементируется, поскольку второй операнд укороченного логического 
		// оператора не вычисляется, а следовательно, инкремент пропускается
		if(false && (++i < 100))
			System.out.println("Эта строка не будет отображаться");
		System.out.println("Инструкция if выполняется. Значение i: " + i); // по прежнему отображается 1.
	}
}