/*
	Демонстрация использования укороченных логических операторов
*/
class ShortOps{
	public static void main(String args[]){
		int n, d, q;

		n = 10;
		d = 2;
		if(d != 0 && (n % d) == 0)
			System.out.println(d + " является делителем " + n);

		d = 0; // попробуем теперь с нулевым значением...
		if(d != 0 && (n % d) == 0) // укороченная операция предотвращает деление на ноль (n % d)!
			System.out.println(d + " является делителем " + n);
		// А теперь то же самое с обыкновенным оператором &
		if(d != 0 & (n % d) == 0) // Теперь вычисляются оба выражения, в результате чего будет выполняться деление на нуль.
			System.out.println(d + " является делителем " + n);
	}
}